//API3PRJ2 JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,TIME=(,1)
//*
//*
//*
//PROG    EXEC PGM=TPPRJ2
//STEPLIB DD   DSN=API3.COBOL.LOAD,DISP=SHR
//ASSUR   DD   DSN=API3.COB.ASSURES,DISP=SHR
//LST     DD   SYSOUT=H
//SYSOUT  DD   SYSOUT=H
